CSI API ETABS v1

# cSelectPreviousSelection Method

---

Restores the previous selection

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int PreviousSelection()

    Function PreviousSelection As Integer

    Dim instance As cSelect
    Dim returnValue As Integer

    returnValue = instance.PreviousSelection()

    int PreviousSelection()

    abstract PreviousSelection : unit -> int

#### Return Value

Type: Int32
Returns zero if the selection is successfully restored, otherwise it returns
nonzero

Remarks

See Also

#### Reference

cSelect Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com